print('Место в купе')

m = int(input("Введите Ваше место: "))

# с помощью функции if зададим условие для определения номера купе в вагоне
if m >= 1 and m <= 4:
    print("Номер купе 1")

# Повторим также для остальных мест в купе
if m >= 6 and m <= 8:
    print("Номер купе 2")
if m >= 9 and m <= 12:
    print("Номер купе 3")
if m >= 13 and m <= 16:
    print("Номер купе 4")
if m >= 17 and m <= 20:
    print("Номер купе 5")
if m >= 21 and m <= 24:
    print("Номер купе 6")
if m >= 25 and m <= 28:
    print("Номер купе 7")
if m >= 29 and m <= 32:
    print("Номер купе 8")
if m >= 34 and m <= 36:
    print("Номер купе 9")
if m > 36:
    print('Такого места нет')