print('=' * 24)
print('| Статус Вашего заказа |')
print('=' * 24)
print()

status = input('Введите статус Вашего заказа (pending/processing/shipped/delivered/cancelled): ')

match status:
    case 'pending':
        status = 'В ожидании⏰'
        desc = 'Ваш заказ ожидает подтверждения'
        time = 'Примерное время обработки 24 часа'
    case 'processing':
        status = 'В обработке ⚙️'
        desc = 'Ваш заказ собирается продавцом'
        time = 'Примерное время сборки 1-2 дня'
    case 'shipped':
        status = 'В доставке 🚛'
        desc = 'Ваш заказ передан в доставку'
        time = 'Примерный срок доставки 1-7 дней'
    case 'delivered':
        status = 'Доставлено 📩'
        desc = 'Ваш заказ доставлен'
        time = 'Срок хранения 14 дней'
    case 'cancelled':
        status = 'Отменено ❌'
        desc = 'Ваш заказ отменен'
        time = 'Заказ закрыт'
    case _:
        print(f"❌ Ошибка: Неизвестный статус (invalid_status)\nДоступные статусы: pending, processing, shipped, delivered, cancelled")
        exit()

print()
print( '=' * 30)
print('| 📦 Статус Вашего заказа 📦 |')
print( '=' * 30)
print()
print(f'Статус: {status}')
print(f'Описание: {desc}')
print(f'Время: {time}')